import pygame   # Готовим игровую билиотеку
'''
map = [[55, 60, 53, 10, 3, 0, 0, 0, 0, 0],
       [52, 53, 10, 3, 0, 0, 0, 0, 0, 0],
       [10, 2, 3, 0, 7, 8, 8, 8, 8, 9],
       [6, 0, 0, 7, 13, 57, 58, 59, 10, 3],
       [6, 0, 0, 4, 5, 51, 61, 56, 12, 9],
       [6, 0, 0, 1, 2, 11, 51, 53, 5, 6],
       [12, 9, 0, 0, 0, 1, 2, 2, 2, 3],
       [59, 12, 9, 0, 0, 0, 0, 0, 0, 0],
       [62, 59, 6, 0, 0, 0, 7, 8, 8, 9],
       [55, 56, 6, 0, 7, 8, 13, 5, 5, 6]]

'''
map = [[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
[0,0,0,0,0,0,0,0,0,0,0,0,0,0,7,8,8,9,0,0,7,8,8,9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
[0,0,0,0,0,0,0,0,0,7,8,8,8,8,13,5,5,6,7,8,13,27,29,6,0,7,8,8,8,9,0,0,0,7,8,9,0,0,0,0,0,7,8,8,8,8,9,0,0,0],
[0,0,0,0,0,0,0,0,0,4,27,28,28,28,29,5,10,3,4,27,28,33,26,12,8,13,27,28,29,6,0,0,7,13,5,12,8,9,0,0,7,13,27,28,28,29,12,9,0,0],
[0,0,0,0,0,0,0,7,8,13,24,25,25,25,26,10,3,7,13,24,25,25,32,28,28,28,33,25,26,6,0,7,13,27,28,28,29,6,7,8,13,27,25,25,25,32,29,6,0,0],
[0,0,0,0,0,7,8,13,27,28,33,25,25,25,26,12,8,13,27,33,25,25,25,25,25,25,25,25,26,12,8,13,27,33,25,25,26,12,13,27,28,33,25,25,15,25,26,6,0,0],
[0,0,7,8,8,13,27,28,33,25,25,25,25,25,32,28,28,28,33,25,25,15,15,15,15,15,15,25,32,28,28,28,33,25,25,25,32,28,28,33,25,25,25,15,25,25,26,6,0,0],
[0,0,4,27,28,28,33,25,25,15,15,15,15,15,25,25,25,25,25,25,15,15,16,16,16,16,15,25,25,25,25,25,25,25,25,25,25,25,25,25,25,15,15,15,25,30,23,6,0,0],
[0,0,4,21,31,25,25,15,15,15,16,16,16,15,15,15,15,15,15,15,15,16,16,16,16,16,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,25,26,10,3,0,0],
[0,0,1,11,24,25,15,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,15,25,25,25,25,26,6,0,0,0],
[0,0,0,4,24,25,15,15,15,15,15,15,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,15,25,25,30,22,22,23,12,9,0,0],
[0,0,0,4,24,25,25,25,25,25,25,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,15,15,25,25,30,23,10,2,2,2,3,0,0],
[0,0,0,4,24,25,30,22,22,22,31,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,25,25,30,23,10,3,0,0,0,0,0,0],
[0,0,0,4,24,25,26,10,2,11,24,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,30,22,23,10,3,0,0,0,0,0,0,0],
[0,0,0,4,21,22,23,6,0,4,24,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,26,10,2,3,0,0,0,0,0,0,0,0],
[0,0,0,1,2,2,2,3,0,4,24,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,26,6,0,0,0,0,0,0,0,0,0,0],
[0,0,0,0,0,0,0,0,0,4,24,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,26,6,0,0,0,0,0,0,0,0,0,0],
[0,0,0,0,7,8,8,8,8,13,24,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,26,6,0,0,0,0,0,0,0,0,0,0],
[0,0,0,0,4,27,28,28,28,28,33,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,26,12,9,0,0,0,0,0,0,0,0,0],
[0,0,0,0,4,21,22,22,22,22,31,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,25,29,12,9,0,0,0,0,0,0,0,0],
[0,0,0,0,1,2,2,2,2,11,24,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,15,25,32,29,6,0,0,0,7,8,8,9,0],
[0,0,0,0,0,0,0,0,0,4,24,25,15,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,15,25,25,26,6,0,7,8,13,5,5,6,0],
[0,0,0,0,0,0,0,0,0,4,24,25,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,16,16,16,16,15,15,25,26,12,8,13,27,28,29,10,3,0],
[0,0,0,0,0,0,0,7,8,13,24,25,25,25,25,25,25,25,25,25,25,25,25,25,15,25,25,25,25,25,25,25,15,15,15,15,15,15,15,25,32,28,28,28,33,30,23,6,0,0],
[0,0,0,0,0,0,0,4,27,29,21,22,22,22,31,25,30,22,22,22,22,22,31,25,25,25,30,22,22,22,25,25,25,25,25,25,25,25,25,25,25,25,25,25,25,26,10,3,0,0],
[0,0,0,0,0,0,0,4,21,23,10,2,2,11,21,22,23,10,11,10,2,11,21,31,25,30,23,10,2,11,21,22,22,22,31,30,22,22,31,25,25,25,30,22,22,23,6,0,0,0],
[0,0,0,0,0,0,0,1,2,2,3,0,0,1,2,2,2,3,4,6,0,1,11,21,22,23,10,3,0,4,10,2,2,11,21,23,10,11,21,31,30,22,23,10,2,11,6,0,0,0],
[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,12,9,0,1,2,2,2,3,0,7,13,12,9,0,1,2,2,3,1,11,21,23,10,2,3,0,1,3,0,0,0],
[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,2,3,0,0,0,0,0,0,0,1,2,2,3,0,0,0,0,0,0,1,2,2,3,0,0,0,0,0,0,0,0],
[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]]


# карта 10*10 клеток, клетка 16*16
# поле 10*16 = 160 * 160

#(len(map[i]))
pygame.init()   # Запускаем игровую билиотеку
X = 160           # Говорим сколько в ширину окно
#Y = 160            # Говорим сколько в высоту окно
Y = 16*(len(map))            # Говорим сколько в высоту окно
screen = pygame.display.set_mode((X, Y))    # Создаёс Окно с именем screen
pygame.display.set_caption("Map")  # Название окна
#НашеНазвание = pygame.image.load("player.png") #Говорим что за картинка
beach1 = pygame.image.load("assets/tiles/bw_01.png")
beach2 = pygame.image.load("assets/tiles/bw_02.png")
beach3 = pygame.image.load("assets/tiles/bw_03.png")
beach4 = pygame.image.load("assets/tiles/bw_04.png")
beach5 = pygame.image.load("assets/tiles/bw_05.png")
beach6 = pygame.image.load("assets/tiles/bw_06.png")
beach7 = pygame.image.load("assets/tiles/bw_07.png")
beach8 = pygame.image.load("assets/tiles/bw_08.png")
beach9 = pygame.image.load("assets/tiles/bw_09.png")
beach10 = pygame.image.load("assets/tiles/bw_10.png")
beach11 = pygame.image.load("assets/tiles/bw_11.png")
beach12 = pygame.image.load("assets/tiles/bw_12.png")
beach13 = pygame.image.load("assets/tiles/bw_13.png")

water = pygame.image.load("assets/tiles/water.png")

green1 = pygame.image.load("assets/tiles/gb_01.png")
green2 = pygame.image.load("assets/tiles/gb_02.png")
green3 = pygame.image.load("assets/tiles/gb_03.png")
green4 = pygame.image.load("assets/tiles/gb_04.png")
green5 = pygame.image.load("assets/tiles/gb_05.png")
green6 = pygame.image.load("assets/tiles/gb_06.png")
green7 = pygame.image.load("assets/tiles/gb_07.png")
green8 = pygame.image.load("assets/tiles/gb_08.png")
green9 = pygame.image.load("assets/tiles/gb_09.png")
green10 = pygame.image.load("assets/tiles/gb_10.png")
green11 = pygame.image.load("assets/tiles/gb_11.png")
green12 = pygame.image.load("assets/tiles/gb_12.png")
green13 = pygame.image.load("assets/tiles/gb_13.png")

green14 = pygame.image.load("assets/Tiles/tile_0036.png")
green15 = pygame.image.load("assets/Tiles/tile_0048.png")
green16 = pygame.image.load("assets/Tiles/tile_0060.png")
green17 = pygame.image.load("assets/Tiles/tile_0072.png")
green18 = pygame.image.load("assets/Tiles/tile_0084.png")
green19 = pygame.image.load("assets/Tiles/tile_0096.png")
green20 = pygame.image.load("assets/Tiles/tile_0111.png")

Black = (0, 0, 0)
Blue = (0, 0, 255)
Gray = (128, 128, 128)
Green = (0, 128, 0)
Red = (255, 0, 0)
White = (255, 255, 255)
Yellow = (255, 255, 0)

def drawmap():
    for i in range(len(map)):
        y = i * 16
        for j in range(len(map[i])):
            x = j * 16
            # print(f"{x},{y}")
            if map[i][j] == 0:
                screen.blit(water, (x, y))
            elif map[i][j] == 1:
                screen.blit(beach1, (x, y))
            elif map[i][j] == 2:
                screen.blit(beach2, (x, y))
            elif map[i][j] == 3:
                screen.blit(beach3, (x, y))
            elif map[i][j] == 4:
                screen.blit(beach4, (x, y))
            elif map[i][j] == 5:
                screen.blit(beach5, (x, y))
            elif map[i][j] == 6:
                screen.blit(beach6, (x, y))
            elif map[i][j] == 7:
                screen.blit(beach7, (x, y))
            elif map[i][j] == 8:
                screen.blit(beach8, (x, y))
            elif map[i][j] == 9:
                screen.blit(beach9, (x, y))
            elif map[i][j] == 10:
                screen.blit(beach10, (x, y))
            elif map[i][j] == 11:
                screen.blit(beach11, (x, y))
            elif map[i][j] == 12:
                screen.blit(beach12, (x, y))
            elif map[i][j] == 13:
                screen.blit(beach13, (x, y))
            elif map[i][j] == 14:
                screen.blit(green14, (x, y))
            elif map[i][j] == 15:
                screen.blit(green15, (x, y))
            elif map[i][j] == 16:
                screen.blit(green16, (x, y))
            elif map[i][j] == 17:
                screen.blit(green17, (x, y))
            elif map[i][j] == 18:
                screen.blit(green18, (x, y))
            elif map[i][j] == 19:
                screen.blit(green19, (x, y))
            elif map[i][j] == 20:
                screen.blit(green20, (x, y))
            elif map[i][j] == 21:
                screen.blit(green1, (x, y))
            elif map[i][j] == 22:
                screen.blit(green2, (x, y))
            elif map[i][j] == 23:
                screen.blit(green3, (x, y))
            elif map[i][j] == 24:
                screen.blit(green4, (x, y))
            elif map[i][j] == 25:
                screen.blit(green5, (x, y))
            elif map[i][j] == 26:
                screen.blit(green6, (x, y))
            elif map[i][j] == 27:
                screen.blit(green7, (x, y))
            elif map[i][j] == 28:
                screen.blit(green8, (x, y))
            elif map[i][j] == 29:
                screen.blit(green9, (x, y))
            elif map[i][j] == 30:
                screen.blit(green10, (x, y))
            elif map[i][j] == 31:
                screen.blit(green11, (x, y))
            elif map[i][j] == 32:
                screen.blit(green12, (x, y))
            elif map[i][j] == 33:
                screen.blit(green13, (x, y))
            else:
                pygame.draw.rect(screen, Red, (x, y, 16, 16))  # pygame.draw.rect(screen, color, (x, y, square, square))
    pygame.display.update()
    return